{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v1.7.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_6",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 100, 100, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "model_7_input"
            }
          },
          {
            "class_name": "Functional",
            "config": {
              "name": "model_7",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 100, 100, 3],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_layer"
                  },
                  "name": "input_layer",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv_layer",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [3, 3],
                    "strides": [1, 1],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv_layer",
                  "inbound_nodes": [[["input_layer", 0, 0, {}]]]
                },
                {
                  "class_name": "Flatten",
                  "config": {
                    "name": "flatten_layer",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                  },
                  "name": "flatten_layer",
                  "inbound_nodes": [[["conv_layer", 0, 0, {}]]]
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "output_layer",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 3,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "output_layer",
                  "inbound_nodes": [[["flatten_layer", 0, 0, {}]]]
                }
              ],
              "input_layers": [["input_layer", 0, 0]],
              "output_layers": [["output_layer", 0, 0]]
            }
          },
          {
            "class_name": "Softmax",
            "config": {
              "name": "softmax_6",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "conv_layer/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        { "name": "conv_layer/bias", "shape": [32], "dtype": "float32" },
        {
          "name": "output_layer/kernel",
          "shape": [307328, 3],
          "dtype": "float32"
        },
        { "name": "output_layer/bias", "shape": [3], "dtype": "float32" }
      ]
    }
  ]
}
